emacs-configs/custom/config.org
#+TITLE: My Emacs Configuration
:PROPERTIES:
#+author: Abdelrahman Madkour
#+property: header-args:emacs-lisp :tangle yes :cache yes :results silent :comments link
#+property: header-args :tangle no :results silent
:END:
* TODO Go through the config and cite all the sources of information
* Early Init
#+begin_src emacs-lisp :tangle "./early-init.el"
;; Ensure Emacs loads the most recent byte-compiled files.
(setq load-prefer-newer t)

;; Make Emacs Native-compile .elc files asynchronously by setting
;; `native-comp-jit-compilation' to t.
(setq native-comp-jit-compilation t)
(setq native-comp-deferred-compilation native-comp-jit-compilation)  ; Deprecated
(setq gc-cons-percentage 0.6)
(setq gc-cons-threshold most-positive-fixnum)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(setq native-comp-async-report-warnings-errors 'silent) ;; native-comp warning (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

(setq idle-update-delay 1.0)
;; Disabling bidi (bidirectional editing stuff)
(setq-default bidi-display-reordering 'left-to-right
			  bidi-paragraph-direction 'left-to-right)
;; (setq bidi-inhibit-bpa t)  ; emacs 27 only - disables bidirectional parenthesis
;;
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
(setq fast-but-imprecise-scrolling t)
(setq inhibit-compacting-font-caches t)

;; Window configuration
(setq frame-inhibit-implied-resize t) ;; Supposed to hasten startup

(setq default-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
;;return file-name-hanlder-alist to default after loading
(add-hook 'emacs-startup-hook
	      (lambda ()
					(setq file-name-handler-alist default-file-name-handler-alist)))
#+end_src
* Compile-angel
#+begin_src emacs-lisp
(use-package compile-angel
  :ensure t
  :demand t
  :config
  ;; Set `compile-angel-verbose' to nil to disable compile-angel messages.
  ;; (When set to nil, compile-angel won't show which file is being compiled.)
  (setq compile-angel-verbose t)

  ;; Uncomment the line below to compile automatically when an Elisp file is saved
  ;; (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode)

  ;; The following directive prevents compile-angel from compiling your init
  ;; files. If you choose to remove this push to `compile-angel-excluded-files'
  ;; and compile your pre/post-init files, ensure you understand the
  ;; implications and thoroughly test your code. For example, if you're using
  ;; the `use-package' macro, you'll need to explicitly add:
  ;; (eval-when-compile (require 'use-package))
  ;; at the top of your init file.
  (push "/init.el" compile-angel-excluded-files)
  (push "/early-init.el" compile-angel-excluded-files)

  ;; A global mode that compiles .el files before they are loaded
  ;; using `load' or `require'.
  (compile-angel-on-load-mode 1))
#+end_src
* GCMH
#+begin_src emacs-lisp
(use-package gcmh
  :diminish gcmh-mode
  :config
  (setq gcmh-idle-delay 5
		gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
  (gcmh-mode 1))

(add-hook 'emacs-startup-hook
	      (lambda ()
			(setq gc-cons-percentage 0.2)
                        (setq gc-cons-threshold 8000000)
                        ))


(add-hook 'emacs-startup-hook
	      (lambda ()
			(message "Emacs ready in %s with %d garbage collections."
					 (format "%.2f seconds"
							 (float-time
							  (time-subtract after-init-time before-init-time)))
					 gcs-done)))
#+end_src

* General configuration
#+begin_src emacs-lisp
;; When emacs asks for "yes" or "no", let "y" or "n" suffice
;;stop bothering me about reload things from disk and just do it
(setq revert-without-query '("pdf"))
(setq use-short-answers t)
(setq ns-pop-up-frames nil)
(setq
 ;; org-roam-node-display-template
 ;; (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag))
 org-ref-notes "~/org/notes/ref-notes"
 org-roam-dir "~/org/notes"
 zot-bib  "~/org/notes/ref-notes/library.bib"
 org-cite-default-bibliography
 (list zot-bib)
 org-cite-csl-styles-dir "~/Zotero/styles"
 org-cite-global-bibliography
 (list zot-bib)
 org-roam-dailies-directory "~/org/fleeting-notes"
 org-roam-directory org-roam-dir)
(add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-side-window)
               (side . right)
			   (slot . 0)
               (window-width . 0.33)
               (window-height . fit-window-to-buffer)
			   (window-parameters . ())))
;dailies template
(setq org-roam-dailies-capture-templates
      '(("d" "default" entry
       	 "* %?"
       	 :target (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
;; Confirm to quit
(setq confirm-kill-emacs 'yes-or-no-p)

(add-hook 'text-mode-hook 'visual-line-mode)
;; Major mode of new buffers
(setq initial-major-mode 'org-mode)

;;make defer always the default
(setq use-package-always-defer t)
;;set default font size
(set-face-attribute 'default nil :height 150)
;; WINDOW -----------

;; Don't resize the frames in steps; it looks weird, especially in tiling window
;; managers, where it can leave unseemly gaps.
(setq frame-resize-pixelwise t)

;; When opening a file (like double click) on Mac, use an existing frame
(setq ns-pop-up-frames nil)

(setq isearch-wrap-pause nil)

;;supposed to not ask me about git
(setq vc-follow-symlinks nil)

;;make agenda current window
(setq org-agenda-window-setup 'current-window)
;; But do not resize windows pixelwise, this can cause crashes in some cases
;; where we resize windows too quickly.
(setq window-resize-pixelwise nil)

;; LINES -----------
(setq-default truncate-lines t)

(setq-default tab-width 4)

(scroll-bar-mode -1)
(setq display-line-numbers-type 'relative)
(global-display-line-numbers-mode)
(line-number-mode)
(column-number-mode)
(display-time-mode -1)
(size-indication-mode 1)
(frame-parameter nil 'left)

;;flymake stuff
(add-hook 'prog-mode-hook 'flymake-mode)

;;flyspell stuff
(add-hook 'text-mode-hook 'flyspell-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)

(defmacro η (fnc)
  "Return function that ignores its arguments and invokes FNC."
  `(lambda (&rest _rest) (funcall ,fnc)))
(advice-add 'org-deadline       :after (η #'org-save-all-org-buffers))
(advice-add 'org-schedule       :after (η #'org-save-all-org-buffers))
(advice-add 'org-store-log-note :after
			(η #'org-save-all-org-buffers))
(advice-add 'org-todo           :after (η #'org-save-all-org-buffers))

;;for the love of god stop the ~s it is so trashy
(setq backup-directory-alist `(("." . "~/.saves")))
;;get rid of startup screen
(setq inhibit-startup-screen t)
;; enable winnr-mode
(winner-mode 1)

(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
               '(text-mode . ("harper-ls" "--stdio"))))
(with-eval-after-load 'eglot
  (add-to-list 'eglot-server-programs
			   '(org-mode . ("harper-ls" "--stdio"))))
(setq-default eglot-workspace-configuration
              '(:harper-ls (:userDictPath ""
                            :fileDictPath ""
                            :linters (:SpellCheck t
                                      :SpelledNumbers :json-false
                                      :AnA t
                                      :SentenceCapitalization t
                                      :UnclosedQuotes t
                                      :WrongQuotes :json-false
                                      :LongSentences t
                                      :RepeatedWords t
                                      :Spaces t
                                      :Matcher t
                                      :CorrectNumberSuffix t)
                            :codeActions (:ForceStable :json-false)
                            :markdown (:IgnoreLinkTitle :json-false)
                            :diagnosticSeverity "hint"
                            :isolateEnglish :json-false
                            :dialect "American")))
#+end_src
